АлогистикТест2/src/DataProcessors/алк_РМ_МастераДГ/алк_РМ_МастераДГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_МастераДГ</name>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Количество</name>
      <comment>Это Объем</comment>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Персонал</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проблемы</name>
    <attributes>
      <name>Проблема</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеСведенияПоУчасткам/алк_ДополнительныеСведенияПоУчасткам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеСведенияПоУчасткам</name>
  <comment>используется в рм мастера для ввода проблем</comment>
  <resources>
    <name>Проблема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_СтатусыОтчетаПроизводства/алк_СтатусыОтчетаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СтатусыОтчетаПроизводства</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Заблокирован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/алк_Участки/алк_Участки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_Участки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДополнительнаяОперация</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяАддендумы</name>
    <comment>Используются аддендумы, вместо ЗаказПокупателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРабочее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураВыпуска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураСписания</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВОтчете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладВыпуска</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСписания</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.алк_Цеха</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДвиженияПроизводства</name>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.алк_ВидыДвиженияПроизводствоОборот</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Целевая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/DataProcessors/алк_РМ_МастераДГ/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  	
	
	Объект.Операция = ПредопределенноеЗначение("Справочник.алк_ОперацииПроизводства.Упаковка");
	
	Если НЕ Параметры.Свойство("ДатаСмены") Тогда //простое открытие     
		
		Если НЕ Объект.ДатаСмены = Дата(1,1,1) Тогда
			Возврат;
		КонецЕсли; 
		
		ПараметрыСменыПоТекущейДате = алк_ПроизводствоСервер.ПроверитьСоответствиеСменыУчастку(Объект.Операция); 
																		
		Если ПараметрыСменыПоТекущейДате = NULL Тогда
			Объект.Операция = Справочники.алк_ОперацииПроизводства.ПустаяСсылка();
			Возврат;
		КонецЕсли;	
		
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена"); 
		
	Иначе  //через документ Производство
		
		ЗаполнитьЗначенияСвойств(Объект, Параметры);	
		
		ЭлементОтбора = Участки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Участок");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Параметры.Участок;
		
		Элементы.ГрШапка.ТолькоПросмотр = Истина;
		Элементы.СоздатьСмену.Видимость = Ложь;
		ЭтаФорма.Заголовок = Параметры.Заголовок;
		
	КонецЕсли; 
	
	ХарактеристикаУп065 	= Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048202");	//0,65т	
	ХарактеристикаУп1 		= Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048203"); 	//1,00т	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ПриСозданииНаСервере(Отказ, Истина);
	ЗаполнитьПараметрыДСУчастки();	
	ПроверитьЗаполнениеСмены();

КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьЗаполнениеСмены()
	ЗаполненСоставСмены = алк_ПроизводствоСервер.ПроверитьЗаполнениеСмены(ЭтаФорма.Объект.Персонал);				
	Элементы.ГрТЧ.Доступность = ЗаполненСоставСмены;
	Элементы.НадписьЗапретПросмотраПокаНеЗаполненСоставСмены.Видимость = НЕ ЗаполненСоставСмены; 	
КонецПроцедуры 
	
Процедура ЗаполнитьПараметрыДСУчастки()
	
	//Заполним параметры динамического списка Участки
	Участки.Параметры.УстановитьЗначениеПараметра("ДатаСмены", Объект.ДатаСмены);
	Участки.Параметры.УстановитьЗначениеПараметра("Смена", Объект.Смена);
	Участки.Параметры.УстановитьЗначениеПараметра("Операция", Объект.Операция);
		
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(алк_ПроизводствоСервер.ПолучитьУчасток(Объект.Операция), Объект.ДатаСмены);
		
КонецПроцедуры

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	
	ТипСменыСоответствует = алк_ПроизводствоСервер.ПроверитьСоответствиеУчасткаСмене(Объект.Операция, Объект.Смена, Объект.ДатаСмены);
	Если Не ЗначениеЗаполнено(ТипСменыСоответствует) Тогда
		Объект.Смена = ПредопределенноеЗначение("Справочник.алк_Смены.ПустаяСсылка");
		Сообщить("Данный вид смен не был задан в регистре Тип смены участка");  
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыДСУчастки();  
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	
	ПараметрыСменыПоТекущейДате = алк_ПроизводствоСервер.ПроверитьСоответствиеСменыУчастку(Объект.Операция, Объект.ДатаСмены);
	Если ПараметрыСменыПоТекущейДате = NULL Тогда
		Объект.Смена = ПредопределенноеЗначение("Справочник.алк_Смены.ПустаяСсылка");
		Сообщить("Смена не была задана в регистре Тип смены участка");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыДСУчастки();
		
КонецПроцедуры

&НаКлиенте
Процедура УчасткиПриАктивизацииСтроки(Элемент) 	
	
	ОбновитьВсеТЧ(); 
	
	ТекущиеДанныеУчастка = Элементы.Участки.ТекущиеДанные;
	
	Если УчастокВыбран() И ТекущиеДанныеУчастка <> Неопределено Тогда
		ОбработатьКнопкиУправленияСменой(ТекущиеДанныеУчастка.Статус);
	КонецЕсли; 
		
КонецПроцедуры

Процедура ОбработатьКнопкиУправленияСменой(ТекущийСтатус)
	Если ТекущийСтатус = Перечисления.алк_СтатусыОтчетаПроизводства.ВРаботе Тогда
		Элементы.ВернутьВРаботу.Видимость = Ложь;
		Элементы.ЗакрытьСмену.Видимость = Истина;
	Иначе
		Элементы.ВернутьВРаботу.Видимость = Истина;
		Элементы.ЗакрытьСмену.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеТЧ()
	
	ОчиститьТЧ();	
	ОбновитьПерсонал(Ложь);  	
	ПроверитьЗаполнениеСмены();

	Если ЗаполненСоставСмены Тогда 
		ОбновитьПродукцию(Ложь); 
		ОбновитьДопЗначения(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТЧ()
	Объект.Персонал.Очистить();
	Объект.Продукция.Очистить();	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьУчастки(Команда) Экспорт
	Элементы.Участки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПерсонал(Команда) Экспорт	
	Если УчастокВыбран() И ПроверитьЗаполнение() Тогда
		Если Модифицированность Тогда
			ПоказатьВопросРежимаРедактированияСоставаСмены();	
		Иначе		
			ОбновитьТЧПерсонал(Элементы.Участки.ТекущиеДанные.Участок);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПродукцию(Команда) Экспорт	
	Если УчастокВыбран() Тогда 
		Если Модифицированность Тогда
			ПоказатьВопросРежимаРедактирования();	
		Иначе		
			ОбновитьТЧПродукция();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьТЧПродукция()
	
	ТекущееПроизводствоОбъект = алк_ПроизводствоСервер.ПолучитьОбъектПроизводстваПоСсылке(Элементы.Участки.ТекущаяСтрока);	
	
	ТЗТекущиеДанные = ТекущееПроизводствоОбъект.Продукция.Выгрузить();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеИзПроизводства.Количество,
	|	ДанныеИзПроизводства.Номенклатура,
	|	ДанныеИзПроизводства.НомерСтроки,
	|	ДанныеИзПроизводства.Период,
	|	ДанныеИзПроизводства.СерийныйНомер,
	|	ДанныеИзПроизводства.Сертификат,
	|	ДанныеИзПроизводства.Характеристика,
	|	ДанныеИзПроизводства.Склад
	|ПОМЕСТИТЬ ДанныеИзПроизводства
	|ИЗ
	|	&ДанныеИзПроизводства КАК ДанныеИзПроизводства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеИзПроизводства.Количество,
	|	ДанныеИзПроизводства.Номенклатура,
	|	ДанныеИзПроизводства.НомерСтроки,
	|	ДанныеИзПроизводства.Период,
	|	ДанныеИзПроизводства.СерийныйНомер,
	|	ДанныеИзПроизводства.Сертификат,
	|	ДанныеИзПроизводства.Характеристика,
	|	ДанныеИзПроизводства.Количество * 1000 КАК КоличествоШтук,
	|	ДанныеИзПроизводства.Склад
	|ИЗ
	|	ДанныеИзПроизводства КАК ДанныеИзПроизводства";
	
	Запрос.УстановитьПараметр("ДанныеИзПроизводства", ТЗТекущиеДанные); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗТекущиеДанные = РезультатЗапроса.Выгрузить();	
	
	Объект.Продукция.Загрузить(ТЗТекущиеДанные);
	
КонецПроцедуры

Процедура ОбновитьТЧПерсонал(УчастокСсылка)
		
	Объект.Бригада = алк_ПроизводствоСервер.ПолучитьБригадуПоСменеИУчастку(Объект.ДатаСмены, Объект.Смена, УчастокСсылка);
	
	ОбъектДокументЧисленныйСоставСмены = алк_ПроизводствоСервер.ПолучитьОбъектЧисленныйСоставСмены(УчастокСсылка, Объект.Смена, Объект.ДатаСмены);	
	
	Если ОбъектДокументЧисленныйСоставСмены <> Неопределено Тогда 
		ТЗТекущиеДанныеПерсонал = ОбъектДокументЧисленныйСоставСмены.Персонал.Выгрузить();	
		Объект.Персонал.Загрузить(ТЗТекущиеДанныеПерсонал);	
		ТЗТекущиеДанныеТранспорт = ОбъектДокументЧисленныйСоставСмены.Транспорт.Выгрузить();	
		Объект.Транспорт.Загрузить(ТЗТекущиеДанныеТранспорт);	
	Иначе
		Объект.Персонал.Очистить();	
		Объект.Транспорт.Очистить();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСмену(Команда)
	Если ПроверитьЗаполнение() Тогда
		ЗначениеОтбора = Новый Структура;  
		ЗначениеОтбора.Вставить("Операция", Объект.Операция); 
		ЗначениеОтбора.Вставить("Цех", алк_ПроизводствоСервер.ПолучитьЦехДГ());	
		ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		ОбработкаВыбора = Новый ОписаниеОповещения("ОткрытьНовуюСменуКлиент", ЭтаФорма);
		ОткрытьФорму("Справочник.алк_Участки.ФормаВыбора",ПараметрыВыбора,,,,,ОбработкаВыбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовуюСменуКлиент(Участок, ДополнительныеПараметры) Экспорт 	
	Если НЕ Участок = Неопределено И алк_ПроизводствоСервер.ОткрытьНовуюСменуСервер(Участок, Объект) Тогда
		ОбновитьУчастки(Ложь);
		ВопросАсинх("", РежимДиалогаВопрос.ОК, 3, КодВозвратаДиалога.ОК , "Смена открыта", КодВозвратаДиалога.ОК);
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСмену(Команда)	
	Если ПроверитьЗаполнение() И УчастокВыбран() Тогда
		Если алк_ПроизводствоСервер.СменитьСтатусПроизводства(Элементы.Участки.ТекущаяСтрока, ПредопределенноеЗначение("Перечисление.алк_СтатусыОтчетаПроизводства.Закрыт")) Тогда
			ОбновитьУчастки(Ложь);
			ВопросАсинх("", РежимДиалогаВопрос.ОК, 3, КодВозвратаДиалога.ОК , "Смена закрыта", КодВозвратаДиалога.ОК);
			ОбработатьКнопкиУправленияСменой(Элементы.Участки.ТекущиеДанные.Статус);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСмену(Команда)
	Если ПроверитьЗаполнение() И УчастокВыбран() Тогда
		Если алк_ПроизводствоСервер.СменитьСтатусПроизводства(Элементы.Участки.ТекущаяСтрока, ПредопределенноеЗначение("Перечисление.алк_СтатусыОтчетаПроизводства.ВРаботе")) Тогда
			ОбновитьУчастки(Ложь);
			ВопросАсинх("", РежимДиалогаВопрос.ОК, 3, КодВозвратаДиалога.ОК , "Смена открыта", КодВозвратаДиалога.ОК);
			ОбработатьКнопкиУправленияСменой(Элементы.Участки.ТекущиеДанные.Статус);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция УчастокВыбран()
	ОчиститьСообщения();
	Если Элементы.Участки.ТекущаяСтрока = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура УчасткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#Область РедактированиеТЧПроизводства

Функция ПолучитьПериодТаблицы(Участок)
	ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Участок);
	Если ПараметрыСменыПоТекущейДате.Смена = Объект.Смена И НачалоДня(ПараметрыСменыПоТекущейДате.ДатаСмены) = Объект.ДатаСмены Тогда  	
		Возврат ТекущаяДата();
	Иначе
		Возврат алк_ОбщегоНазначенияКлиентСервер.ПолучитьВремяКонцаСмены(Объект.Смена, Объект.ДатаСмены);	
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПродукцияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Модифицированность = Истина;
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Период = ПолучитьПериодТаблицы(Элементы.Участки.ТекущиеДанные.Участок);
		Элемент.ТекущиеДанные.Номенклатура = алк_ПроизводствоСервер.ПолучитьНоменклатуруПоУчастку(Элементы.Участки.ТекущиеДанные.Участок, "Выпуск");
		Элемент.ТекущиеДанные.Склад =  РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(Элементы.Участки.ТекущиеДанные.Участок, "СкладВыпуска");
	КонецЕсли;
	
	Если Копирование Тогда
    	Элемент.ТекущиеДанные.СерийныйНомер = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияХарактеристикаПриИзменении(Элемент)
	ОбновитьОбъемТекущейСтроки(Элементы.Продукция.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКоличествоШтукПриИзменении(Элемент)
	ОбновитьОбъемТекущейСтроки(Элементы.Продукция.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбъемТекущейСтроки(ТекДанные, Материалы = Ложь)
	
	ОчиститьСообщения();

	ТекДанные.Количество = 0;	
	
	Если ЗначениеЗаполнено(ТекДанные.Характеристика) 
		И ЗначениеЗаполнено(ТекДанные.КоличествоШтук) 
		И ПроверкаСоответствияВесаХарактеристике(ТекДанные.КоличествоШтук, ТекДанные.Характеристика) Тогда
		ТекДанные.Количество = РасчитатьОбъем(ТекДанные.Характеристика, ТекДанные.КоличествоШтук);
	КонецЕсли;
	
КонецПроцедуры

Функция РасчитатьОбъем(ХарактеристикаСтроки, КоличествоШтук) 	
	Возврат КоличествоШтук * РегистрыСведений.алк_ПараметрыХарактеристик.ПолучитьОбъемПоХарактеристике(ХарактеристикаСтроки); 	
КонецФункции	

&НаКлиенте
Процедура РежимРедактированияТЧПриИзменении(Элемент)
	
	Если НЕ УчастокВыбран() Тогда
		РежимРедактированияТЧ = НЕ РежимРедактированияТЧ; //Вернем режим
		Сообщить("Выберите участок");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ПоказатьВопросРежимаРедактирования();	
	Иначе
		//Запомним ТЧ которую редактируем
		Если РежимРедактированияТЧ Тогда
			Элементы.ЗаписатьТЧ.Картинка = БиблиотекаКартинок.ПроверкаВыполняется;
			Элементы.ГрТЧ.ЦветФона = Новый Цвет(193, 255, 181); 
		Иначе
			Элементы.ЗаписатьТЧ.Картинка = БиблиотекаКартинок.ПроверкаУспешна;
			Элементы.ГрТЧ.ЦветФона = Новый Цвет(255, 255, 255);
		КонецЕсли;
		
		ОбновитьВсеТЧ(); 
		
		Если Элементы.Страницы.ТекущаяСтраница.Заголовок = "Дополнительно" Тогда 
			Элементы.ГруппаПроблемы.ТолькоПросмотр = НЕ РежимРедактированияТЧ;
		КонецЕсли;
		
		Если алк_ПроизводствоСервер.ПоставитьСнятьБлокировкуПроизводства(Элементы.Участки.ТекущаяСтрока, РежимРедактированияТЧ) Тогда	
			Элементы.ГрСоставСмены.Доступность = НЕ РежимРедактированияТЧ;
			Элементы.ГрЛево.Доступность = НЕ РежимРедактированияТЧ;
			Элементы.ГрШапка.Доступность = НЕ РежимРедактированияТЧ;   				
			Элементы.ЗаписатьТЧ.Доступность = РежимРедактированияТЧ;
			Элементы.ПродукцияДобавитьПакеты.Доступность = РежимРедактированияТЧ;
			Элементы.ПечатьЭтикеток.Доступность = РежимРедактированияТЧ;
			Элементы.Продукция.ТолькоПросмотр = НЕ РежимРедактированияТЧ;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросРежимаРедактирования()
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаРежимаРедактирования", ЭтотОбъект);	
	ПоказатьВопрос(Оповещение,
	"Сохранить текущие изменения?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Установлен режим редактирования" // (необ.) заголовок
	);   
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаРежимаРедактирования(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		//Вызов Команды записать
		Если ПроверитьЗаполнение() И ЗаписатьТЧНаСервере(Элементы.Участки.ТекущаяСтрока) Тогда
			Модифицированность = Ложь;
			СнятьРежимРедактирования();
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		СнятьРежимРедактирования();  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьРежимРедактирования()
	РежимРедактированияТЧ = Ложь; //Снимаем режим редактирования
	РежимРедактированияТЧПриИзменении(Элементы.РежимРедактированияТЧ);	
КонецПроцедуры

&НаСервере
Функция ЗаписатьТЧНаСервере(ПроизводствоСсылка)
	
	Если Элементы.Страницы.ТекущаяСтраница.Заголовок = "Дополнительно" Тогда
		
		РегистрыСведений.алк_ДополнительныеСведенияПоУчасткам.ЗаписатьДопСведения(Объект.ДатаСмены,Объект.Смена
		,ПроизводствоСсылка.Участок,Объект.Проблемы.Выгрузить()); 
		
		Возврат Истина;
		
	Иначе
		
		ТекущееПроизводствоОбъект = алк_ПроизводствоСервер.ПолучитьОбъектПроизводстваПоСсылке(ПроизводствоСсылка);
		
		НоваяТЧ = Объект.Продукция.Выгрузить();
		
		ТекущееПроизводствоОбъект.Продукция.Загрузить(НоваяТЧ);  
		
		Попытка
			ТекущееПроизводствоОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Возврат Истина;
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьТЧ(Команда)  
	Если ПроверитьЗаполнение() И ЗаписатьТЧНаСервере(Элементы.Участки.ТекущаяСтрока) Тогда
		Модифицированность = Ложь;
		СнятьРежимРедактирования();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РедактированиеСоставаСмены

&НаКлиенте
Процедура РежимРедактированияСоставаСменыПриИзменении(Элемент)
	
	Если НЕ УчастокВыбран() Тогда
		РежимРедактированияСоставаСмены = НЕ РежимРедактированияСоставаСмены; //Вернем режим
		Сообщить("Выберите участок");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ПоказатьВопросРежимаРедактированияСоставаСмены();	
	Иначе
		
		Если РежимРедактированияСоставаСмены Тогда 
			Элементы.ЗаписатьСоставСмены.Картинка = БиблиотекаКартинок.ПроверкаВыполняется;
			Элементы.ГрСоставСмены.ЦветФона = Новый Цвет(193, 255, 181); 
		Иначе
			Элементы.ЗаписатьСоставСмены.Картинка = БиблиотекаКартинок.ПроверкаУспешна;
			Элементы.ГрСоставСмены.ЦветФона = Новый Цвет(255, 255, 255);
		КонецЕсли;
		
		ОбновитьВсеТЧ();
		
		Элементы.ГрТЧ.Доступность = НЕ РежимРедактированияСоставаСмены;
		Элементы.ГрУчастки.Доступность = НЕ РежимРедактированияСоставаСмены;
		Элементы.ГрШапка.Доступность = НЕ РежимРедактированияСоставаСмены;
		
		Элементы.ЗаписатьСоставСмены.Доступность = РежимРедактированияСоставаСмены;
		//Элементы.Бригада.Доступность = РежимРедактированияСоставаСмены;
		Элементы.Персонал.ТолькоПросмотр = НЕ РежимРедактированияСоставаСмены;
		Элементы.Транспорт.ТолькоПросмотр = НЕ РежимРедактированияСоставаСмены;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросРежимаРедактированияСоставаСмены()
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаРежимаРедактированияСоставаСмены", ЭтотОбъект);	
	ПоказатьВопрос(Оповещение,
	"Сохранить текущие изменения?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Установлен режим редактирования состава смены" // (необ.) заголовок
	);   
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаРежимаРедактированияСоставаСмены(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		//Вызов Команды записать
		Если ПроверитьЗаполнение() И ЗаписатьСоставСменыНаСервере(Элементы.Участки.ТекущиеДанные.Участок) Тогда
			Модифицированность = Ложь;
			СнятьРежимРедактированияСоставаСмены();
		Иначе
			РежимРедактированияСоставаСмены = Истина;
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		СнятьРежимРедактированияСоставаСмены();  
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		РежимРедактированияСоставаСмены = Истина; //Возвращаем режим редактирования
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьРежимРедактированияСоставаСмены()
	РежимРедактированияСоставаСмены = Ложь; //Снимаем режим редактирования
	РежимРедактированияСоставаСменыПриИзменении(Элементы.РежимРедактированияТЧ);	
КонецПроцедуры

&НаСервере
Функция ЗаписатьСоставСменыНаСервере(УчастокСсылка)
	
	Возврат алк_ПроизводствоСервер.РМ_Мастер_ЗаписатьЧисленныйСоставСмены(УчастокСсылка, Объект);
		
КонецФункции  

&НаКлиенте
Процедура ЗаписатьСоставСмены(Команда)
	Если ПроверитьЗаполнение() И ЗаписатьСоставСменыНаСервере(Элементы.Участки.ТекущиеДанные.Участок) Тогда
		Модифицированность = Ложь;
		СнятьРежимРедактированияСоставаСмены();
	Иначе
		РежимРедактированияСоставаСмены = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерсоналПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПродукцияПриАктивизацииСтроки(Элемент)
	Если УчастокВыбран() И Объект.Продукция.Количество() > 0 Тогда
		Если Элемент.ТекущиеДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		//Настроим параметры выбора сертификата
		НовыйПараметрСертификата = Новый ПараметрВыбора("Отбор.КатегорияНоменклатуры", Элемент.ТекущиеДанные.Номенклатура);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметрСертификата);
		ПараметрыВыбораСертификата = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ПродукцияСертификат.ПараметрыВыбора = ПараметрыВыбораСертификата;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСертификатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если УчастокВыбран() И Объект.Продукция.Количество() > 0 Тогда
		//Настроим параметры выбора сертификата
		НовыйПараметрСертификата = Новый ПараметрВыбора("Отбор.КатегорияНоменклатуры", алк_ПроизводствоСервер.ПолучитьКатегориюНоменклатуры(Элементы.Продукция.ТекущиеДанные.Номенклатура));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметрСертификата);
		ПараметрыВыбораСертификата = Новый ФиксированныйМассив(НовыйМассив);		
		Элементы.ПродукцияСертификат.ПараметрыВыбора = ПараметрыВыбораСертификата;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)	
	
	ОчиститьСообщения();

	Если ИсточникВыбора.ИмяФормы = "Обработка.алк_РМ_МастераДГ.Форма.ФормаДобавленияПакетов" Тогда
		
		Для Каждого Стр Из ВыбранноеЗначение Цикл
			Если ПроверкаСоответствияВесаХарактеристике(Стр.КоличествоШтук, Стр.Характеристика) И ПроверкаНаДобавлениеПакета(Стр.СерийныйНомер) Тогда	
				СтрокаПродукция = Объект.Продукция.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПродукция, Стр, "Номенклатура, Характеристика, Сертификат, СерийныйНомер, КоличествоШтук, Количество,Склад");
				СтрокаПродукция.Период = ПолучитьПериодТаблицы(Элементы.Участки.ТекущиеДанные.Участок);
				Модифицированность = Истина;	
			КонецЕсли;
		КонецЦикла;  
		
		СтрокВТаблице = Объект.Продукция.Количество();              
		
		Если СтрокВТаблице > 0 Тогда	
			Элементы.Продукция.ТекущаяСтрока = Объект.Продукция[СтрокВТаблице-1].ПолучитьИдентификатор();			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаНаДобавлениеПакета(СерийныйНомер, СерийныйНомерИсключение = Неопределено)
	
	РазрешеноДобавитьПакет = Истина; 
	
	Отбор = Новый Структура("СерийныйНомер", СерийныйНомер);
	ПоискДублей = Объект.Продукция.НайтиСтроки(Отбор);
	
	Если ПоискДублей.Количество() <> 0 И СерийныйНомер <> СерийныйНомерИсключение Тогда
		Сообщить("Пакет: " + СерийныйНомер + " был добавлен ранее");
		РазрешеноДобавитьПакет = Ложь;	
	КонецЕсли; 
	
	МассивСоставСерийныйНомер = СтрРазделить(Строка(СерийныйНомер), "-", Ложь);

	Если МассивСоставСерийныйНомер[1] <> Формат(Объект.ДатаСмены, "ДФ=yy") Тогда	
		Сообщить("Пакет: " + СерийныйНомер + " не соответствует году текущей смены");
		РазрешеноДобавитьПакет = Ложь;
	КонецЕсли;	
	
	////Костыль проверки дубля пакета, Убрать когда будет написана общая проверка дублей	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка
	//	|ИЗ
	//	|	Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
	//	|ГДЕ
	//	|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер = &СерийныйНомер
	//	|	И НЕ алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.ПометкаУдаления
	//	|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.Проведен
	//	|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.ДатаСмены >= НАЧАЛОПЕРИОДА(&ДатаСмены, ГОД)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	алк_ПроизводствоПродукция.Ссылка
	//	|ИЗ
	//	|	Документ.алк_Производство.Продукция КАК алк_ПроизводствоПродукция
	//	|ГДЕ
	//	|	алк_ПроизводствоПродукция.СерийныйНомер = &СерийныйНомер
	//	|	И НЕ алк_ПроизводствоПродукция.Ссылка.ПометкаУдаления
	//	|	И алк_ПроизводствоПродукция.Ссылка.Проведен
	//	|	И алк_ПроизводствоПродукция.Ссылка.ДатаСмены >= НАЧАЛОПЕРИОДА(&ДатаСмены, ГОД)";
	//
	//Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	//Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
	//	РазрешеноДобавитьПакет = Ложь;
	//	Сообщить("Данный сериый номер уже использовался ранее");
	//КонецЕсли;
	//
	////\\\\\КОНЕЦ КОСТЫЛЯ
		
	Возврат РазрешеноДобавитьПакет;
	
КонецФункции

&НаКлиенте
Процедура ПродукцияПослеУдаления(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("ДатаСмены") Тогда
		Настройки.Очистить(); 
	КонецЕсли     
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсоналПослеУдаления(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТранспортПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТранспортПослеУдаления(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПакеты(Команда) 
	
	ПараметрыОткрытия = Новый Структура("Дата, Номенклатура, ЗакрыватьПриВыборе, Склад", Объект.ДатаСмены, алк_ПроизводствоСервер.ПолучитьНоменклатуруПоУчастку(Элементы.Участки.ТекущиеДанные.Участок, "Выпуск"), Ложь,РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(Элементы.Участки.ТекущиеДанные.Участок, "СкладВыпуска"));
	ОткрытьФорму("Обработка.алк_РМ_МастераДГ.Форма.ФормаДобавленияПакетов",ПараметрыОткрытия, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		
КонецПроцедуры   

&НаКлиенте
Процедура РапортСмены(Команда)
	Если УчастокВыбран() Тогда	
		ТабДок = Новый ТабличныйДокумент;   	
		
		СформироватьРапортСмены(ТабДок, Элементы.Участки.ТекущаяСтрока);
		
		ИдентификаторПечатнойФормы = "РапортСменыДГ";
		НазваниеПечатнойФормы = НСтр("ru = 'Рапорт смены ДГ'");
		
		МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
		КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
		ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
		ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
		ПечатнаяФорма.ТабличныйДокумент = ТабДок;
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
		
		ОбластиОбъектов = Новый СписокЗначений;
		МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
		
		ДокументыПечатались = Истина;   
	Иначе
		Сообщить("Участок не выбран!");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СформироватьРапортСмены(ТабличныйДокумент, ТекущийДокумент) Экспорт
	
		
	ТекНомерСтроки = 0;  
	Макет = ПолучитьОбщийМакет("алк_ОбщийМакетРапортСменыДляРабочегоМестаМастера");  //Обработки.алк_РМ_МастераЦПШ.ПолучитьМакет("РапортСмены");
	
	//Области
	Шапка		 	= Макет.ПолучитьОбласть("Шапка");
	ШапкаТаблицы 	= Макет.ПолучитьОбласть("Область2");
	СтрокаТаблицы	= Макет.ПолучитьОбласть("СтрокаТаблицы1");
	ИтогоТаблица	= Макет.ПолучитьОбласть("ИтогоТаблица");
	Подвал			= Макет.ПолучитьОбласть("Подвал");
	///////\\\\\\\\
	
	Шапка.Параметры.Организация 		= ТекущийДокумент.Организация;
	Шапка.Параметры.ДатаСменыПрописью 	= Формат(ТекущийДокумент.ДатаСмены, "ДЛФ=ДД");
	Шапка.Параметры.ДатаСмены 			= Формат(ТекущийДокумент.ДатаСмены, "ДФ=dd.MM.yyyy");
	Шапка.Параметры.Смена 				= ТекущийДокумент.Смена;
	
	ТабличныйДокумент.Вывести(Шапка);
	
	ИтоговыйТабличныйДокумент = Новый ТабличныйДокумент;
	ИтоговыйТабличныйДокумент.Вывести(ШапкаТаблицы);
	
	ИтоговыйДляПроверки = Новый ТабличныйДокумент;
	ИтоговыйДляПроверки.Вывести(Шапка);
	ИтоговыйДляПроверки.Вывести(ШапкаТаблицы);

	ЗаполненнаяСтраница = Новый ТабличныйДокумент;
	
	ТЗ = ТекущийДокумент.Продукция.Выгрузить();                                                                                       
	
	ПерваяСтраницаСШапкой = Истина;
	
	ВОднойКолонке = ?((ТЗ.Количество() / 3) > Цел(ТЗ.Количество() / 3), Цел(ТЗ.Количество() / 3) + 1, Цел(ТЗ.Количество() / 3)); 
	 
	Для Каждого ТекСтрокаПродукция Из ТЗ Цикл
					
		ТекНомерСтроки = ТекНомерСтроки + 1;
		СтрокаТаблицы.Параметры.НомерСтроки1 = ТекНомерСтроки;
		СтрокаТаблицы.Параметры.СерийныйНомерПакета1 = ТекСтрокаПродукция.СерийныйНомер;
		СтрокаТаблицы.Параметры.МассаПакета1 = ТекСтрокаПродукция.Количество*1000;
		
		ПроверочныйТД = Новый Массив; 
		ПроверочныйТД.Добавить(СтрокаТаблицы);
		
		ПомещаетсяВТекущуюКолонку = (ТекНомерСтроки - 1) / ВОднойКолонке <> 1 И (ТекНомерСтроки -1) / ВОднойКолонке <> 2;  
			
			Если ИтоговыйДляПроверки.ПроверитьВывод(ПроверочныйТД) И ПомещаетсяВТекущуюКолонку Тогда
				ИтоговыйТабличныйДокумент.Вывести(СтрокаТаблицы);
				ИтоговыйДляПроверки.Вывести(СтрокаТаблицы);
			Иначе
				Если ЗаполненнаяСтраница.ПроверитьПрисоединение(ИтоговыйТабличныйДокумент) Тогда
					ЗаполненнаяСтраница.Присоединить(ИтоговыйТабличныйДокумент);
					ВОднойКолонке = ТекНомерСтроки - 1;
				Иначе
					ТабличныйДокумент.Вывести(ЗаполненнаяСтраница);
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ПерваяСтраницаСШапкой = Ложь;
					ЗаполненнаяСтраница    = Новый ТабличныйДокумент;
					ЗаполненнаяСтраница.Присоединить(ИтоговыйТабличныйДокумент);
					ВОднойКолонке = ?(((ТЗ.Количество()- ТекНомерСтроки) / 3) > Цел((ТЗ.Количество()- ТекНомерСтроки) / 3), Цел((ТЗ.Количество()- ТекНомерСтроки) / 3) + 1, Цел((ТЗ.Количество()- ТекНомерСтроки) / 3)); 
				КонецЕсли;
				
				ИтоговыйТабличныйДокумент  = Новый ТабличныйДокумент;			
				ИтоговыйТабличныйДокумент.Вывести(ШапкаТаблицы);
				ИтоговыйТабличныйДокумент.Вывести(СтрокаТаблицы);
				
				ИтоговыйДляПроверки = Новый ТабличныйДокумент;
				Если ПерваяСтраницаСШапкой Тогда	
					ИтоговыйДляПроверки.Вывести(Шапка);
				КонецЕсли;
				ИтоговыйДляПроверки.Вывести(ШапкаТаблицы);
				ИтоговыйДляПроверки.Вывести(СтрокаТаблицы);
				
			КонецЕсли;	    	
		
	КонецЦикла;
	
	//ВыводОстаточных данных которые не успели вывестись в цикле
	Если ЗаполненнаяСтраница.ПроверитьПрисоединение(ИтоговыйТабличныйДокумент) Тогда
		ЗаполненнаяСтраница.Присоединить(ИтоговыйТабличныйДокумент);
	Иначе
		ТабличныйДокумент.Вывести(ЗаполненнаяСтраница);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ЗаполненнаяСтраница    = Новый ТабличныйДокумент;
		ЗаполненнаяСтраница.Присоединить(ИтоговыйТабличныйДокумент);							
	КонецЕсли;	
	ТабличныйДокумент.Вывести(ЗаполненнаяСтраница);
	
	ИтогоТаблица.Параметры.КоличествоИтог = ТекНомерСтроки;
	ИтогоТаблица.Параметры.МассаИтог = ТекущийДокумент.Продукция.Итог("Количество");
	ТабличныйДокумент.Вывести(ИтогоТаблица);
	
	// Подвал
	ТабличныйДокумент.Вывести(Подвал);	
	
КонецПроцедуры

Функция ПроверкаСоответствияВесаХарактеристике(Вес, Характеристика)
		
	Если Характеристика = ХарактеристикаУп065 Тогда   //0,65т
		ВДиапазон = 700;
		НДиапазон = 600;
		ПроверкаДиапазона = Истина;
	ИначеЕсли Характеристика = ХарактеристикаУп1 Тогда //1,00т
		ВДиапазон = 1200;
		НДиапазон = 701;
		ПроверкаДиапазона = Истина; 
	Иначе
		ПроверкаДиапазона = Ложь;
	КонецЕсли;
	
	Если ПроверкаДиапазона И НЕ(Вес >= НДиапазон И Вес <= ВДиапазон) Тогда
		Сообщить("Ошибка! Значение веса выходит из возможного диапазона"); 
		Возврат Ложь;	
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции  

&НаКлиенте
Процедура ПечатьЭтикеток(Команда)
	
	ОткрытьформуПечатьЭтикеток();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьформуПечатьЭтикеток(МассивВыбранныхПакетов = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Смена", Объект.Смена);
	ПараметрыФормы.Вставить("ДатаСмены", Объект.ДатаСмены); 
	ПараметрыФормы.Вставить("Номенклатура", алк_ПроизводствоСервер.ПолучитьНоменклатуруПоУчастку(Элементы.Участки.ТекущиеДанные.Участок, "Выпуск"));
	
	ОткрытьФорму("Обработка.алк_РМ_МастераДГ.Форма.ПечатьЭтикеток", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСерийныйНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если НЕ ПроверкаНаДобавлениеПакета(ВыбранноеЗначение, Элементы.Продукция.ТекущиеДанные.СерийныйНомер) Тогда
		ВыбранноеЗначение = Неопределено;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если РежимРедактированияТЧ Тогда
		СнятьРежимРедактирования();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДопЗначения(Команда)
	Если УчастокВыбран() Тогда
		Если Модифицированность Тогда
			ПоказатьВопросРежимаРедактирования();	
		Иначе		
			ОбновитьДопЗначенияНаФорме();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры   

Процедура ОбновитьДопЗначенияНаФорме()  
	//Заполняем проблемы участка	
	Объект.Проблемы.Загрузить(РегистрыСведений.алк_ДополнительныеСведенияПоУчасткам.ВернутьПроблемыУчастка(Объект.ДатаСмены
	,Объект.Смена,Элементы.Участки.ТекущаяСтрока.Участок));   
	//\\
КонецПроцедуры

&НаКлиенте
Процедура ПроблемыПослеУдаления(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
